In [3]:
import pandas as pd

# 1. DataFrame 생성
data = {
    "이름": ["김철수", "이영희", "박민수"],
    "나이": [23, 21, 25],
    "도시": ["서울", "부산", "대구"],
    "점수": [85, 90, 78]
}
df = pd.DataFrame(data)
df

    이름  나이  도시  점수
0  김철수  23  서울  85
1  이영희  21  부산  90
2  박민수  25  대구  78

In [4]:
import pandas as pd

data = {
    "이름": ["김철수", "이영희", "박민수"],
    "나이": [23, 21, 25], 
    "도시": ["서울", "부산", "대구"], 
    "점수": [85, 90, 78]
}

df1 = pd.DataFrame(data)
df1

    이름  나이  도시  점수
0  김철수  23  서울  85
1  이영희  21  부산  90
2  박민수  25  대구  78

In [7]:
# 나이의 평균
df2 = df["나이"].mean()
df2

np.float64(23.0)

In [9]:
df3 = df[df["점수"] >= 80]
df3

    이름  나이  도시  점수
0  김철수  23  서울  85
1  이영희  21  부산  90

In [10]:
df["결과"] = "합격"
df

    이름  나이  도시  점수  결과
0  김철수  23  서울  85  합격
1  이영희  21  부산  90  합격
2  박민수  25  대구  78  합격

In [11]:
df5 = df["점수"].mean()
df5

np.float64(84.33333333333333)

In [14]:
df["이름+도시"]= df["이름"].str.cat(df["도시"], sep="_")
df

    이름  나이  도시  점수  결과   이름+도시
0  김철수  23  서울  85  합격  김철수_서울
1  이영희  21  부산  90  합격  이영희_부산
2  박민수  25  대구  78  합격  박민수_대구